---
kind: property
id: P:Autodesk.Revit.DB.FloorType.ThermalProperties
source: html/6f9d4f62-7790-f885-da06-7711588359be.htm
---
# Autodesk.Revit.DB.FloorType.ThermalProperties Property

The calculated and settable thermal properties of the FloorType

## Syntax (C#)
```csharp
public ThermalProperties ThermalProperties { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - the floor does not have thermal properties.